"""
Des api状态code类 描述各个接口的不同状态信息
@Author thetheOrange
Time 2024/5/22
"""


class StatusCode:
    # ================================ 鉴权相关状态start ================================

    # 注册错误
    RegisterError: str = "REGISTER_ERROR"
    # 登录错误
    LoginError: str = "LOGIN_ERROR"
    # 用户不存在
    UserNotFound: str = "USER_NOT_FOUND"

    # ================================ 鉴权相关状态end ================================

    # ================================ 文本大模型相关状态start ================================

    # 用户token不足
    TokenNotEnough: str = "TOKEN_NOT_ENOUGH"

    # ================================ 文本大模型相关状态end ================================

    # ================================ 语音大模型相关状态start ================================

    # 使用语音转文字模型时错误
    AudioToTextError: str = "AUDIO_TO_TEXT_ERROR"

    # ================================ 语音大模型相关状态end ================================

    # ================================ 图片识别文字大模型相关状态start ================================

    # 用户使用图片文字识别模型次数不足
    PicTimesNotEnough: str = "PIC_TIMES_NOT_ENOUGH"

    # 使用图片文字识别模型时错误
    PictureToTextError: str = "PICTURE_TO_TEXT_ERROR"

    # ================================ 图片识别文字大模型相关状态end ================================
